/* Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1 */

// Console.Write($"Type number: ");
// int.TryParse(Console.ReadLine(), out int num);
// Console.Write($"{num % 100 / 10}\n");



/* Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5

78 -> третьей цифры нет

32679 -> 6 */

// Console.Write("Type number ");
// string num = (Console.ReadLine());
// if (num.Length < 3)
//     Console.WriteLine($"{num} -> третьей цифры нет");
// else
//     Console.WriteLine($"{num} -> " + num[2]);



/* Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет */

// Console.Write("Type number [from 1 to 7]: ");
// int.TryParse(Console.ReadLine(), out int num);
// if (num == 6 || num == 7)
// {
//     Console.WriteLine($"{num} -> да");
// }
// else
//     Console.WriteLine($"{num} -> нет");